views/transaksi/_form.php

SELECT * FROM "produk"
---

    <?= $form->field($model, 'tanggal_transaksi')->widget(DatePicker::className(),['clientOptions' => ['dateFormat' => 'yy-mm-dd']]) ?>

    <?= $form->field($model, 'id_produk')
         ->dropDownList(ArrayHelper::map(Produk::find()->all(),'id_produk','nama_produk'),
        ['prompt'=>'Pilih Makanan']) ?>