models/User.php

    public static function findIdentity($id_pengguna)
    {
        //mencari user login berdasarkan IDnya dan hanya dicari 1.
        $user = Pengguna::findOne($id_pengguna);
---
SELECT * FROM "pengguna" WHERE "id_pengguna"=1